{
	"landing": {  
		"firstName": "Piotr",
		"lastName": "Kram",
		"bio": "I am a Software Engineer at DRW interested in algorithmics, research, optimisation, machine learning, full-stack development and generally applied Computer Science. I enjoy problem solving, creative thinking, learning and all-round development. I dislike too much monotony and stagnation.",
		"email": "piotr.kram7@gmail.com",
		"linkedin": "https://www.linkedin.com/in/piotr-kram/",
		"github": "https://github.com/KramPiotr",
		"devpost": "https://devpost.com/PiotrKram"
	},
	"projects": [
		{
			"name": "Music generation",
			"date": "October 2020 - May 2021",
			"photo": "music_generation.png",
			"video": "https://youtu.be/YmnZM8d9GCg", 
			"description": "This was my 3rd year dissertation project at the University of Cambridge. During the seven months of allocated time, I developed and evaluated three music generation methods: two variants of recurrent neural networks that use the attention mechanism and a Markov chain. Moreover, I published a dynamic web application that was used to evaluate the music against other music generation methods like a random generator, a state of the art music generator and a human composer. The website also allows for real-time music generation using the Markov chain. Apart from that, I designed an algorithm to flag plagiarism in music pieces. The video presented here contains a walk-through of the web application.",
			"technologies": "Python and its libraries i.a. Music21, Tensorflow, Keras, Magenta, Matplotlib, Seaborn, Numpy, Pandas;  FFmpeg; FluidSynth; React Native; JavaScript; CSS; Express.js; Node.js; Linux - high-performance computing, dynamic web hosting; LaTeX",
			"extralink": "https://pk485.user.srcf.net/"
		},
		{
			"name": "Hero",
			"date": "November-December 2019",
			"photo": "hero.png",
			"video": "https://www.youtube.com/watch?v=Xbgi7HNT_uI",
			"description": "Me and my teammates solved a problem prevalent in third world countries. In some places in the world it takes more than 40 minutes for an ambulance to reach an accident's scene. Through our system eligible people can register and be notified by an ambulance dispatcher about an accident in their vicinity so that the help can be given as fast as possible. The project won two awards during Oxford Hackathon 2019 and we decided to improve it and submit it for the Microsoft Imagine Cup competition. My task was to create the React Native front-end and integrate it with the back-end developed by my peers. The youtube video you see contains a demonstration of the front-end at the end.",
			"technologies": "React Native, JavaScript, CSS, Firebase platform",
			"github": "https://github.com/KramPiotr/ImagineCup2020",
			"devpost": "https://devpost.com/software/oxhack2019",
			"extralink": "http://oxfordhack.com/"
		},
		{
			"name": "Machine learning tutoring",
			"date": "March-August 2020",
			"photo": "machine_learning_classes.PNG",
			"inside_photo": "machine_learning_classes_inside.PNG",
			"technologies": "IPython in Google Colaboratory; Python and its libraries i.a. Scikit-learn, Numpy, Pandas, Tensorflow, Keras, Matplotlib",
			"description": "As a tutor, together with my student we went through practical fundamentals of machine learning. The main topics we covered: linear regression, logistic regression, support vector machines, decision trees, ensemble learning and random forests, dimensionality reduction, unsupervised learning techniques, basic neural networks, convolutional neural networks, recurrent neural networks, natural language processing, autoencoders, generative adversarial networks, reinforcement learning, tutorial of tensorflow 2.0, advanced tensorflow/IPython tools, basics of quantum computing in machine learning. For each topics we went through practical implementations in python with thorough understanding and experimentation."
		},
		{
			"name": "Green eyes",
			"github": "https://github.com/mahclark/GreenEyes/tree/master",
			"photo": "green_eyes.png",
			"video": "https://youtu.be/b21W1tDoAbc",
			"date": "February-March 2020",
			"technologies": "Unity, C#",
			"description": "The project was part of my Computer Science studies at the University of Cambridge. Together in a group of 5 students we created an application for Microsoft Hololens that evaluates the impact of an item on the environment given a picture of the item. The project was supervised by the IMC Trading company. My responsibilities were to develop the look and the logic behind the GUI on Microsoft Hololens."
		},
		{
			"name": "Purgo space",
			"date": "January 2020",
			"photo": "purgo_space.PNG",
			"inside_photo": "purgo_space_inside.PNG",
			"description": "Together with 3 of my friends we created a piece of software to tackle the issue of trash in cities. One part of the solution is a mobile application that shows you on a map where trashes and bins are so that you could scan a trash with your camera, put it in a bin and earn up to 5 pounds in voucher rewards. The map also shows you how full each bin is (we developed a piece of hardware that could be put inside bins to check for this). Apart from the mobile application we also developed a web application for people overseeing the project and a machine learning algorithm that could detect trashes on the streets from video footage of cameras that are attached to cars/public transport so that we have the data to put in the mobile application. The project was created during the 'Hack Cambridge 2020' hackathon and won two awards: 'Green IoT - best use of IoT in a project that tackles environmental issue' and 'MongoDB challenge - best use of MongoDB database'. My job was creating back-end for the project. I set up communication between hardware and mobile front-end and I built a database of users and trashes. I also helped with developing the web application front-end.",
			"devpost": "https://devpost.com/software/hackcambridge2020-s9vw0g",
			"github": "https://github.com/KramPiotr/HackCambridge2020",
			"extralink": "https://hackcambridge.com/",
			"technologies": "MongoDB, JavaScript, Express.js, Node.js, AngularJS, Microsoft Azure services"
		},
		{
			"name": "Catch me if you can",
			"date": "December 2019",
			"photo": "catch_me_if_you_can.PNG",
			"video": "https://youtu.be/h9lFfxmlyWc",
			"description": "A 2-player game in which you try to catch the other player in a limited amount of time on a playground with a lot of obstacles. I created the game with my friend in the Unity framework during the Game Gig 2019 hackathon in Cambridge.",
			"github": "https://github.com/KramPiotr/Catch-Me-If-You-Can",
			"devpost": "https://devpost.com/software/catch-me-if-you-can-z5l4wi",
			"extralink": "https://www.hackathon.com/event/game-gig-2019-75833414785",
			"technologies": "Unity, C#"
		},
		{
			"name": "Weather app",
			"date": "May 2019",
			"photo": "weather_app.PNG",
			"video": "https://youtu.be/A0uONoiOwas",
			"description": "Together with 4 other students from my year we created a weather application in JavaFX that lets you display and customize the display of current weather conditions for different cities around the world, The desktop application was developed for the Interactive Design course from the first year of the Computer Science course at the University of Cambridge.",
			"github": "https://github.com/KramPiotr/WeatherApp2019",
			"technologies": "Java, JavaFX"
		},
		{
			"name": "BlokeChain",
			"date": "March 2019",
			"photo": "blokechain.PNG",
			"inside_photo": "blokechain_inside.PNG",
			"description": "Together with 3 other friends we created a decentralized application to verify medical prescriptions using TODA protocol. The project won the People's choice award during the Cambridge-Bradfield hackathon 2019.",
			"devpost": "https://devpost.com/software/cbhack",
			"github": "https://github.com/KramPiotr/CBHack",
			"extralink": "https://www.eventbrite.com/e/cbhack-cambridge-bradfield-hackathon-tickets-55250422501#",
			"technologies": "Blockchain, TODA protocol, React, JavaScript, CSS"
		},
		{
			"name": "SuPORT",
			"photo": "wawcode.PNG",
			"video": "https://youtu.be/bRJzsE_hmN4",
			"description": "Together with 2 of my friends we created a mobile app that gives users real-time information about current state of different sport centres/playing fields (number of people occupying the object, whether they are actively playing etc.) so that it's easier for users to group up for team sports. We created the project during the spring edition of the 'Wawcode 2019' hackathon and we won 2nd place award. I was in charge of developing the mobile application and my friends developed machine learning models used for analyzing CCTV footages.",
			"technologies": "Android, Java, XML",
			"extralink": "http://wawcode.pl/",
			"date": "April 2019"
		},
		{
			"name": "PDF combiner",
			"date": "January 2020",
			"photo": "pdf_combine.PNG",
			"video": "https://youtu.be/hsCFdxK1R9Y",
			"description": "I created a simple end-to-end program to preview, extract and combine pages from different pdfs together with images. It was the first time I used Tkinter python framework for GUI creation. I did it for a private use and to have some learning and fun over the winter break.",
			"technologies": "Python, Tkinter library"
		},
		{
			"name": "Luno challenge",
			"date": "July-August 2020",
			"photo": "luno_challenge.PNG",
			"inside_photo": "luno_challenge_inside.PNG",
			"description": "Together with 2 other friends we built a trading bot for the Luno exchange and run it on my Raspberry Pi 4B. We created the bot to take part in the Luno challenge which was one of the challenges in the Spark University Hackathon. During 8 weeks of the hackathon we tried and utilised the common trading techniques like arbitrage, moving averages and linear regression to trade with different cryptocurrencies. We ended up making profit of around 40 dollars and finished the hackathon on the 5th position (from around 30 teams).",
			"extralink": "https://medium.com/encode-club/spark-university-hackathon-summary-and-winners-3c5e5a743b12#5a28:~:text=Piotr%20Kram%E2%80%99s%20team",
			"technologies": "Python, Raspberry Pi 4B"
		},
		{
			"name": "WiFi Fever",
			"date": "December 2018",
			"photo": "wifi_fever.png",
			"video": "https://youtu.be/f16HjZgMysg",
			"description": "A game in which you have to place an object (a router) so that the sum of the distances from other objects (phones) is the smallest possible. I created the game in the Love2D framework during the Game Gig 2018 hackathon in Cambridge. It was the first hackathon I participated in.",
			"devpost": "https://devpost.com/software/wifi-fever",
			"extralink": "https://www.hackathon.com/event/game-gig-2018---one-button-edition-52238026343",
			"technologies": "Love2D, Lua"
		},
		{
			"name": "Educational webpage",
			"date": "October 2016 - May 2017",
			"photo": "inwersja.PNG",
			"inside_photo": "inwersja_inside.PNG",
			"description": "I created an interactive website popularizing inversion, a very useful transformation in geometry, using the funds from the Mazovian scholarship for talented students. Sadly, after a few years of online presence, the webpage is no longer available on the internet.",
			"technologies": "PHP, HTML, CSS, JavaScript",
			"extralink": "https://stypendia.oeiizk.waw.pl/"
		}
	],
	"experience": [
		{
			"position": "Software Engineer",
			"organization": "DRW",
			"team": "Global Delta 1",
			"aboutWork": "creating and supporting trading software utilising Java, JavaScript, Python, Bash and Zsh programming languages",
			"fromDate": "October 2021",
			"toDate": "June 2023"
		},
		{
			"position": "Enterprise Engineer Intern",
			"organization": "Facebook",
			"team": "Logistics & Operations - Material Movements",
			"aboutWork": "completed a project that manages outstanding work items in Facebook's data centres\nworked full-stack: Hack (dialect of PHP created by Facebook) and GraphQL for back-end, React Native for front-end",
			"fromDate": "June 2021",
			"toDate": "September 2021"
		},
		{
			"position": "Software Development Engineer Intern",
			"organization": "Amazon",
			"team": "Alexa Speech",
			"aboutWork": "worked on decoupling lexicon building for different languages (a lot of problem solving around internal Amazon software and my Linux Cloud Desktop)\ncreated and published online a package (using mainly python, bash and a dialect of scheme) responsible for grapheme to phoneme training",
			"fromDate": "August 2020",
			"toDate": "October 2020"
		},
		{
			"position": "Technology Development Intern",
			"organization": "Barclays",
			"team": "Public Cloud Engineering",
			"aboutWork": "worked on detecting duplication between AWS Cloud Formation templates\npre-processed the templates and created a GUI (using the tkinter library in python) for experts to compare and see differences between different template fragments",
			"fromDate": "July 2020",
			"toDate": "August 2020"
		},
		{
			"position": "Software Engineering Intern",
			"organization": "Utterberry",
			"aboutWork": "worked on web applications in JavaScript\nanalysed 3D transformations and their implementations in Three.js\nworked on mobile applications in React Native\ncoded simple back-ends using Express.js and MongoDB",
			"fromDate": "June 2019",
			"toDate": "October 2019"
		},
		{
			"position": "Mobile Development Intern",
			"organization": "Connectis_",
			"aboutWork": "worked on a mobile application in Xamarin technology for the Android platform (api 19+)",
			"fromDate": "July 2017",
			"toDate": "August 2017"
		},
		{
			"position": "Tutor",
			"organization": "",
			"aboutWork": "taught theoretical and practical machine learning (from 03.2020 until 08.2020)\nprepared students for the admission exam and interviews for the Computer Science course at the best UK universities\ntaught computer architecture (from 10.2020 until 01.2021)\nsupervised computer architecture course programming assignments in C (from 07.2021 until 08.2021)\nsupervised AI course programming assignments in Python (from 09.2021 until 11.2021)",
			"fromDate": "March 2020",
			"toDate": "Present"
		}

	],
	"education": [{
			"university": "University of Cambridge",
			"degree": "B.A. in Computer Science",
			"gpa": "",
			"fromDate": "October 2018",
			"toDate": "June 2021"
		},
		{
			"university": "XIV High School in Warsaw",
			"degree": "Matex - special class for mathematically gifted students",
			"gpa": "100% in Computer Science, Maths and English official graduation exams",
			"fromDate": "September 2015",
			"toDate": "May 2018"
		}
	],
	"presentations": [{
			"original_title": "Deep Learning in Medical Imaging - a Practical Introduction",
			"short_title": "Medical Computer Vision",
			"photo": "deep_learning.png",
			"conference": "AI in radiological diagnostics",
			"location": "Online - Greifswald Medical School",
			"date": "11 January 2021",
			"description": "I was honoured to have the opportunity to present during a conference about the use of AI in radiological diagnostics. I gave a talk that introduces participants to the world of deep learning, medical imaging and deep learning applied to medical imaging. I finished the presentation with a practical walk-through of the code I created to solve a simple pneumonia detection problem.",
			"url": "https://ai-radiology.eu/deep-learning-in-medical-imaging-a-practical-introduction/",
			"video": "https://www.youtube.com/watch?v=3s3ui6Jq6zs"
		}
	],
	"skills": 
	{"certificates":[{
		"name": "Machine Learning",
		"organization": "Coursera",
		"credentialID": "QJYEUTPDQVS2"
	},
	{
		"name": "Google Code-in 2017",
		"organization": "Google",
		"description": "completed 3 programming tasks concerned with open-source software"
	}
	],	
		"languagesAndFrameworks":[
		{
			"name": "Java"
		},
		{
			"name": "Python"
		},
		{
			"name": "C++"
		},
		{
			"name": "C"
		},
		{
			"name": "JavaScript"
		},
		{
			"name": "React Native"
		},
		{
			"name": "React"
		},
		{
			"name": "Xamarin"
		},
		{
			"name": "C#"
		},
		{
			"name": "Android"
		},
		{
			"name": "HTML/CSS"
		},
		{
			"name": "XML/XAML"
		},
		{
			"name": "SML"
		},
		{
			"name": "SystemVerilog"
		},
		{
			"name": "Prolog"
		},
		{
			"name": "OpenGL"
		},
		{
			"name": "SQL"
		},
	    {
			"name": "Bash"
		},
		{
			"name": "Hack, a dialect of PHP"
		},
		{
			"name": "GraphQL"
		}],
	"paradigmsAndTools":[{
			"name": "Machine Learning and Data Processing in Python (numpy, pandas, scikit-learn, matplotlib, keras, tensorflow)"
		},
		{
			"name": "Algorithms and data structures"
		},
		{
			"name": "Advanced problem solving"
		},
		{
			"name": "Object-oriented programming"
		},
		{
			"name": "Functional programming (mostly in SML)"
		},
		{
			"name": "Git"
		},
		{
			"name": "Windows & Linux consoles"
		},
		{
			"name": "Microsoft Office 365"
		},
		{
			"name": "Mongo DB"
		},
		{
			"name": "Unity"
		},
		{
			"name": "Developing for Microsoft Hololens"
		},
		{
			"name": "Unix tools"
		},
		{
			"name": "AWS services"
		}
	]},
	"interests": {
		"paragraphOne": "Apart from Computer Science, I love sports. I regularly play football and work out at the gym.",
		"paragraphTwo": "Moreover, I like music. I have graduated from a music school and in my free time I play the guitar, the piano and sing.",
		"paragraphThree": "Additionally, I am very curious about the surrounding world. I learn languages (Spanish and German at the moment) and I read about psychology, geography, economy and politics."
	},
	"awards": {
	"university": [
		{
			"awardDetail": "the Green IoT award and the MongoDB award during the 'Hack Cambridge 2020' hackathon"
		},
		{
			"awardDetail": "Best Hack for Social Good award and startmeup sponsor prize during the 'Oxford Hack 2019' Hackathon"
		},
		{
			"awardDetail": "2nd place in the spring edition of the Wawcode 2019 Hackathon in Warsaw"
		},
		{
			"awardDetail": "the Winner of the trading challenge organized by the Cambridge University Algorithmic Trading Society and the IMC trading company"
		},
		{
			"awardDetail": "People's choice award in the Cambridge-Bradfield blockchain Hackathon (CBHACK)"
		},
		{
			"awardDetail": "5th place in the Luno Challenge during the Spark hackathon"
		}],
	"earlier": [{
			"awardDetail": "the Finalist of the 67th and the 69th editions of Polish Mathematical Olympiad"
		},
		{
			"awardDetail": "the Laureate of the 17th, the 18th and the 19th editions of the Mathematical Competition for High School Students organised by the Warsaw University of Technology"
		},
		{
			"awardDetail": "the Laureate of the Jagiellonian Mathematical Tournament 2017/2018"
		},
		{
			"awardDetail": "the Winner of the Mathematical League of the Warsaw University of Technology (2018)"
		},
		{
			"awardDetail": "the Laureate of the 11th polish edition of the International Challenge on Informatics and Computational Thinking 'Bebras'"
		},
		{
			"awardDetail": "the Recipient of the Mazovian scholarship for talented students awarded for a project concerned with creating an interactive website popularizing inversion - one of the most important mathematical transformations"
		},
		{
			"awardDetail": "the Laureate of the 10th edition of the Mathematical Olympiad for Lower Secondary School Students"
		},
		{
			"awardDetail": "the Scholar of the Polish National Fund for Gifted Children"
		},
		{
			"awardDetail": "2nd place in the international, team mathematical competition NABOJ 2015/2016"
		},
		{
			"awardDetail": "the Finalist of the Physics 2014/2015 and the Philosophy 2013/2014 regional competitions"
		}
	]}
}